Repository: NoSFeR88/habito-pro-flutter
Catalog: lib/l10n/app_*.arb
Languages: da, es, id

source: May
es: Mayo

source: June
es: Junio

source: July
es: Julio

source: August
es: Agosto

source: September
es: Septiembre

source: October
es: Octubre

source: November
es: Noviembre

source: December
es: Diciembre

# mondayFull
source: Monday
es: Lunes

# tuesdayFull
source: Tuesday
es: Martes

# wednesdayFull
source: Wednesday
es: Miércoles

# thursdayFull
source: Thursday
es: Jueves

# fridayFull
source: Friday
es: Viernes

# saturdayFull
source: Saturday
es: Sábado

# sundayFull
source: Sunday
es: Domingo

source: Theme mode
es: Modo de Tema

source: Light
es: Claro

source: Dark
es: Oscuro

source: System
es: Sistema

source: App Information
es: Información de la App

source: App Name
es: Nombre de la App

source: Version
es: Versión

source: Current Language
es: Idioma Actual

source: Supported Languages
es: Idiomas Soportados

source: Pause
es: Pausar

source: Resume
es: Reanudar

source: Pending
es: Pendiente

source: Monthly
es: Mensual

source: Annual
es: Anual

source: Lifetime
es: De por Vida

source: LIMITED OFFER
es: Oferta Limitada

# unlockFullPotential
source: Unlock the full potential of Ritmo
es: Desbloquea el Potencial Completo

source: Start with Ritmo PRO
es: Comenzar con Ritmo PRO

# noAdvertisingFeature
source: No advertising
es: Sin publicidad

source: Completely clean experience
es: Experiencia completamente limpia

source: Cloud backup
es: Respaldo en la nube

# yourDataSafeInCloud
source: Your data safe in the cloud
es: Tus datos seguros en la nube

source: AI Insights
es: Análisis con IA

source: Intelligent recommendations
es: Recomendaciones inteligentes

source: Choose your plan
es: Elige tu plan

# beginnerlevel
source: Beginner
es: Principiante

# apprenticeLevel
source: Apprentice
es: Aprendiz

# dedicatedLevel
source: Dedicated
es: Dedicado

# consistentLevel
source: Consistent
es: Constante

# expertLevel
source: Expert
es: Experto

# masterLevel
source: Master
es: Maestro

# legendLevel
source: Legend
es: Leyenda

# championLevel
source: Champion
es: Campeón

# heroLevel
source: Hero
es: Héroe

# mythicLevel
source: Mythic
es: Mítico

# maximumLevel
source: Maximum
es: Nivel Máximo

# defaultUser
source: User
es: Usuario

source: Activate Notifications
es: Activar Notificaciones

# updateAllNotificationsText
source: Update all notifications
es: Actualizar todas las notificaciones

source: Notifications rescheduled successfully
es: Notificaciones reprogramadas exitosamente

source: Notification Help
es: Ayuda con notificaciones

source: Help with Notifications
es: Ayuda con notificaciones

source: Understood
es: Entendido

# languagesCount
source: {count} languages
es: {count} idiomas

source: Icon
es: Icono

source: Frequency
es: Frecuencia

source: Reminder
es: Recordatorio

source: Reminder time
es: Hora de Recordatorio

source: Danger Zone
es: Zona de peligro

# pleaseEnterName
source: Please enter a name
es: Por favor ingresa un nombre

# nameMinTwoCharacters
source: Name must be at least 2 characters
es: El nombre debe tener al menos 2 caracteres

# basicInformationLabel
source: Basic Information
es: Información Básica

# deleteWarningMessage
source: This action cannot be undone. All habit data including completion history will be deleted.
es: Esta acción no se puede deshacer. Se eliminarán todos los datos del hábito incluyendo el historial de completados.

source: total points
es: puntos totales

# progressToLevel
source: Progress to level {level}
es: Progreso al nivel {level}

source: Max level reached!
es: ¡Nivel máximo alcanzado!

source: Max Streak
es: Racha máxima

source: Tap to view more
es: Toca para ver más

source: Achievement Unlocked!
es: ¡Logro desbloqueado!

source: Excellent!
es: ¡Excelente!

# pointsWithCount
source: {count} points
es: {count} puntos

# unlockedLabel
source: Unlocked
es: Desbloqueado

source: {percent}% Completed
es: {percent}% Completado

source: Total Habits
es: Total de ritmos

source: {percent}% This week
es: {percent}% esta semana

source: {percent}% This month
es: {percent}% este mes

source: days
es: días

# twoWeeks
source: 2 wks
es: 2 sem.

# oneMonth
source: 1 month
es: 1 mes

# weekNumber
source: Week {number} of {year}
es: Semana {number} del {year}

# dayOfMonth
source: Day {day} of {total}
es: Día {day} de {total}

# dateFormat
source: {day} {month}
es: {day} de {month}

source: Good morning
es: Buenos días

# motivationPerfectDay
source: PERFECT! 🎆\nYou completed EVERYTHING today.\nYou're unstoppable!
es: ¡PERFECTO! 🎆\nHas completado TODO hoy.\n¡Eres imparable!

# motivationAlmostPerfect
source: Almost perfect! 🌟\nJust a little bit left.\nYou can do it!
es: ¡Casi perfecto! 🌟\nSolo te falta un poquito.\n¡Tú puedes!

# motivationExcellentDay
source: Excellent day! 💪\nYou're doing great.\nKeep it up!
es: ¡Excelente día! 💪\nVas súper bien.\n¡Sigue así!

# motivationGoodProgress
source: Good progress! 🚀\nYou're on the right track.\nDon't stop!
es: ¡Buen progreso! 🚀\nVas por buen camino.\n¡No pares!

# motivationStarted
source: You started! 🌱\nEvery step counts.\nContinue!
es: ¡Ya empezaste! 🌱\nCada paso cuenta.\n¡Continúa!

# motivationFirstStep
source: First step! ⭐\nThe hardest part is over.\nKeep going!
es: ¡Primer paso! ⭐\nLo más difícil ya pasó.\n¡Sigue!

# motivationYourMoment
source: Your moment! 🌅\nStart now.\nMake it happen!
es: ¡Tu momento! 🌅\nComienza ahora.\n¡Hazlo realidad!

# motivationPerfectWeek
source: PERFECT WEEK! 🏆\nYou mastered all your rhythms.\nYou're incredible!
es: ¡SEMANA PERFECTA! 🏆\nDominaste todos tus hábitos.\n¡Eres increíble!

# motivationBrutalWeek
source: Brutal week! 🔥\nAlmost perfect.\nYou're a champion!
es: ¡Semana brutal! 🔥\nCasi perfecto.\n¡Eres un crack!

# motivationGreatWeek
source: Great week! 💪\nYour discipline pays off.\nWell done!
es: ¡Gran semana! 💪\nTu disciplina paga.\n¡Bien ahí!

# motivationGoodRhythm
source: Good rhythm! 📈\nYou're building.\nKeep it up!
es: ¡Buen ritmo! 📈\nVas construyendo.\n¡Sigue así!

# motivationProgressing
source: Progressing! 🌱\nEvery week counts.\nDon't stop!
es: ¡Progresando! 🌱\nCada semana cuenta.\n¡No pares!

# motivationStartedWeek
source: Started! ✨\nYou took the first step.\nLet's improve!
es: ¡Empezaste! ✨\nYa diste el primer paso.\n¡Mejoremos!

# motivationNewWeek
source: New week! 🌟\nFresh start.\nMake it epic!
es: ¡Nueva semana! 🌟\nFresh start.\n¡Hazla épica!

# motivationLegendaryMonth
source: LEGENDARY MONTH! 👑\nTotal perfection.\nYou're inspiration!
es: ¡MES LEGENDARIO! 👑\nPerfección total.\n¡Eres inspiración!

# motivationEpicMonth
source: Epic month! 🎆\nIncredible results.\nUnstoppable!
es: ¡Mes épico! 🎆\nResultados increíbles.\n¡Imparable!

# motivationSolidMonth
source: Solid month! 💪\nYour consistency pays off.\nGreat work!
es: ¡Sólido mes! 💪\nTu constancia paga.\n¡Genial trabajo!

# motivationGoodMonth
source: Good month! 📊\nYou're progressing.\nKeep improving!
es: ¡Buen mes! 📊\nVas progresando.\n¡Sigue mejorando!

# motivationBuilding
source: Building! 🏗️\nEvery month counts.\nKeep going!
es: ¡Construyendo! 🏗️\nCada mes cuenta.\n¡Pa'lante!

# motivationSeedsPlanted
source: Seeds planted! 🌱\nYou've started.\nYou'll grow!
es: ¡Semillas plantadas! 🌱\nYa comenzaste.\n¡Crecerás!

# motivationNewMonth
source: New month! 🚀\nInfinite possibilities.\nMake it yours!
es: ¡Nuevo mes! 🚀\nInfinitas posibilidades.\n¡Hazlo tuyo!

# motivationPerfectShort
source: PERFECT! You completed everything today
es: ¡PERFECTO! Completaste todo hoy

# motivationAlmostPerfectShort
source: Almost perfect! Just a little bit left
es: ¡Casi perfecto! Solo te falta un poquito

# motivationExcellentShort
source: Excellent day! You're doing great
es: ¡Excelente día! Vas súper bien

# motivationGoodProgressShort
source: Good progress! You're on the right track
es: ¡Buen progreso! Vas por buen camino

# motivationStartedShort
source: You started! Every step counts
es: ¡Ya empezaste! Cada paso cuenta

# motivationFirstStepShort
source: First step! The hardest part is over
es: ¡Primer paso! Lo más difícil ya pasó

# motivationYourMomentShort
source: Your moment! Start now
es: ¡Tu momento! Comienza ahora

source: Statistics
es: Estadísticas

source: Week
es: Semana

source: Trends
es: Tendencias

# completedHabits
source: Completed
es: Completados

source: Percentage
es: Porcentaje

# progressToday
source: Today's Progress
es: Progreso de Hoy

# completedCount
source: Completed
es: Completados

# pendingCount
source: Pending
es: Pendientes

# noHabitsToShow
source: No rhythms to show
es: No hay hábitos para mostrar

source: Today's Habits
es: Ritmos de Hoy

# noHabitsScheduledToday
source: You have no habits scheduled for today or you've completed them all.
es: No tienes hábitos programados para hoy o ya los completaste todos.

source: Weekly Progress
es: Progreso Semanal

# dayShortMon
source: M
es: L

# dayShortTue
source: T
es: M

# dayShortWed
source: W
es: X

# dayShortThu
source: T
es: J

# dayShortFri
source: F
es: V

# dayShortSun
source: S
es: D

source: Weekly Heat Map
es: Mapa de Calor Semanal

source: Legend
es: Leyenda

source: Not scheduled
es: No programado

# week1
source: W1
es: S1

# week2
source: W2
es: S2

# week3
source: W3
es: S3

# week4
source: W4
es: S4

source: Week Habits
es: Hábitos de la Semana

# weekProgress
source: {completed} of {total} days
es: {completed} de {total} días

source: Habit Limit Reached
es: Límite de Hábitos Alcanzado

# habitLimitMessage
source: You've reached the limit of {limit} habits in the free plan. Upgrade to Ritmo PRO for unlimited habits and premium features!
es: Has alcanzado el límite de {limit} hábitos en el plan gratuito. ¡Actualiza a Ritmo PRO para hábitos ilimitados y funciones premium!

source: Upgrade to PRO
es: Actualizar a PRO

source: Enable Notifications
es: Habilitar Notificaciones

# notificationsDescription
source: Receive reminders for your habits
es: Recibe recordatorios para tus hábitos

source: Default Reminder Time
es: Hora de Recordatorio Predeterminada

source: Reminder Sound
es: Sonido de Recordatorio

source: Vibration
es: Vibración

# soundDefault
source: Default
es: Predeterminado

# soundNone
source: None (Silent)
es: Ninguno (Silencioso)

# soundChime
source: Chime
es: Campana

# soundBell
source: Bell
es: Timbre

# loadingHabits
source: Loading your rhythms...
es: Cargando tus ritmos...

# guestModeWarning
source: Guest mode - Your data will not be saved
es: Modo invitado - Tus datos no se guardarán

source: Create Account
es: Crear Cuenta

# saveYourProgressTitle
source: Save your progress
es: Guardar tu progreso

# createAccountDescription
source: Create an account to save your rhythms and sync them across devices.
es: Crea una cuenta para guardar tus hábitos y sincronizarlos entre dispositivos.

# accountCreatedSuccess
source: Account created successfully!
es: ¡Cuenta creada exitosamente!

# rhythmoPro
source: HábitoPro
es: RitmoPro

# productivityCoach
source: Your productivity coach
es: Tu coach de productividad

# enjoyRitmoInterruptions
source: Enjoy Ritmo without interruptions with Ritmo PRO:
es: Disfruta de Ritmo sin interrupciones con Ritmo PRO:

# unlimitedHabits
source: Unlimited rhythms
es: Ritmos ilimitados

# advancedStats
source: Advanced statistics
es: Estadísticas avanzadas

# pricingText
source: Only $3.99/month - 20% less than competition
es: Solo $3.99/mes - 20% menos que la competencia

source: Paywall coming soon
es: Paywall próximamente disponible

# paywallNotImplementedTitle
source: Coming Soon
es: Próximamente

# paywallNotImplementedMessage
source: The payment system is under development. For now, you can activate Ritmo PRO from Settings > "Activate Premium (Testing)".
es: El sistema de pagos está en desarrollo. Por ahora, puedes activar Ritmo PRO desde Ajustes > "Activar Premium (Testing)".

# paywallMainTitle
source: Unlock Ritmo's full potential
es: Desbloquea todo el potencial de Ritmo

# paywallChoosePlan
source: Choose your plan
es: Elige tu plan

# paywallStartButton
source: Start with Ritmo PRO
es: Comenzar con Ritmo PRO

# paywallTermsAndConditions
source: By continuing, you accept our Terms of Service and Privacy Policy
es: Al continuar, aceptas nuestros Términos de Servicio y Política de Privacidad

# manageHabitsTooltip
source: Manage habits
es: Gestionar hábitos

# notificationTroubleshootingTips
source: • Verify that notifications are enabled in system settings • Make sure the app is not in "Do Not Disturb" mode • Check that habits have reminder times configured
es: • Verifica que las notificaciones estén activadas en la configuración del sistema • Asegúrate de que la app no esté en modo "No molestar" • Comprueba que los hábitos tengan horarios de recordatorio configurados

# loginTitle
source: HabitPro
es: HábitoPro

# loginSubtitle
source: Build better habits, day by day
es: Construye mejores hábitos, día a día

# signInButton
source: Sign In
es: Iniciar Sesión

# emailLabel
source: Email
es: Correo electrónico

# emailValidationError
source: Please enter a valid email
es: Por favor ingresa un email válido

# passwordLabel
source: Password
es: Contraseña

# passwordRequiredError
source: Please enter your password
es: Por favor ingresa tu contraseña

# passwordLengthError
source: Password must be at least 6 characters
es: La contraseña debe tener al menos 6 caracteres

# forgotPassword
source: Forgot your password?
es: ¿Olvidaste tu contraseña?

# signInOrCreateAccount
source: Sign In
es: Iniciar Sesión

source: or continue with
es: o continúa con

source: Welcome back!
es: ¡Bienvenido de nuevo!

source: Account created successfully!
es: ¡Cuenta creada exitosamente!

# statsGoodMonth
source: Good month! 📊 You're progressing. Keep improving!
es: ¡Buen mes! 📊 Vas progresando. ¡Sigue mejorando!

# statsBuilding
source: Building! 🏗️ Every month counts. Keep going!
es: ¡Construyendo! 🏗️ Cada mes cuenta. ¡Pa'lante!

# statsSeedsPlanted
source: Seeds planted! 🌱 You've started. You'll grow!
es: ¡Semillas plantadas! 🌱 Ya comenzaste. ¡Crecerás!

# statsNewMonth
source: New month! 🚀 Infinite possibilities. Make it yours!
es: ¡Nuevo mes! 🚀 Infinitas posibilidades. ¡Hazlo tuyo!

source: Sign Up
es: Registrarse

# fullNameLabel
source: Full name
es: Nombre completo

# nameRequiredError
source: Please enter your name
es: Por favor ingresa tu nombre

# emailRequiredError
source: Please enter your email
es: Por favor ingresa tu email

# firstStreakAchievement
source: First Streak
es: Primera Racha

# weekWarriorAchievement
source: Week Warrior
es: Guerrero Semanal

# monthMasterAchievement
source: Month Master
es: Maestro del Mes

# firstStepAchievement
source: First Step
es: Primer Paso

# centuryClubAchievement
source: Century Club
es: Club del Centenar

# marathonRunnerAchievement
source: Marathon Runner
es: Maratonista

# perfectWeekAchievement
source: Perfect Week
es: Semana Perfecta

# rhythmCollectorAchievement
source: Collector
es: Coleccionista

# rhythmMasterAchievement
source: Rhythm Master
es: Maestro del Ritmo

# streakFormat
source: {streak} days
es: {streak, plural, =1{1 día} other{{streak} días}}

# notificationsToRemindHabits
source: Notifications to remind you to complete your daily rhythms
es: Notificaciones para recordar completar tus hábitos diarios

# rhythmReminderTicker
source: Habit reminder
es: Recordatorio de hábito

# defaultHabitReminder
source: Time to work on your rhythm!
es: ¡Es hora de trabajar en tu hábito!

# testNotificationBody
source: Notification system working correctly!
es: ¡Sistema de notificaciones funcionando correctamente!

# rhythmUpdatedMessage
source: Habit updated!
es: ¡Hábito actualizado!

# openSystemSettingsMessage
source: Open system settings to manage notifications
es: Abrir configuración del sistema para gestionar notificaciones

source: Not receiving reminders?
es: ¿No recibes recordatorios?

# rhythmDeletedMessage
source: Habit deleted
es: Hábito eliminado

# updateError
source: Error updating rhythm
es: Error al actualizar el hábito

# deleteError
source: Error deleting rhythm
es: Error al eliminar el hábito

# habitUpdatedMessage
source: Rhythm updated!
es: ¡Ritmo actualizado!

# habitDeletedMessage
source: Rhythm deleted
es: Ritmo eliminado

# habitNameLabel
source: Rhythm Name
es: Nombre del Ritmo

# habitReminders
source: Rhythm Reminders
es: Recordatorios de Ritmos

# habitReminderTicker
source: Rhythm reminder
es: Recordatorio de ritmo

# habitStreaks
source: Rhythm Streaks
es: Rachas por Ritmo

# habitCollectorAchievement
source: Rhythm Collector
es: Coleccionista de Ritmos

# habitCreatedSuccessfully
source: Rhythm created successfully
es: Ritmo creado exitosamente

# habitNameHint
source: E.g: Exercise, Read, Meditate...
es: Ej: Ejercicio, Leer, Meditar...

source: Welcome to Ritmo PRO! 🎉
es: ¡Bienvenido a Ritmo PRO! 🎉

source: Purchase error
es: Error en la compra

source: Send
es: Enviar

# passwordResetMessage
source: Enter your email and we'll send you a link to reset your password.
es: Ingresa tu email y te enviaremos un enlace para restablecer tu contraseña.

source: Error creating habit
es: Error creando ritmo

# languageChangedTo
source: Language changed to {languageName}
es: Idioma cambiado a {languageName}

# themeExecutiveMinimalist
source: 💼 Executive Minimalist
es: 💼 Ejecutivo Minimalista

# themeGlassmorphism
source: ✨ Glassmorphism
es: ✨ Glasmorfismo

# themeNeumorphism
source: 🎭 Neumorphism
es: 🎭 Neumorfismo

source: All done for today!
es: ¡Todo listo por hoy!

source: Welcome to Ritmo!
es: ¡Bienvenido a Ritmo!

# startYourJourney
source: Start your journey to better habits by creating your first daily habit.
es: Comienza tu viaje hacia mejores hábitos creando tu primer hábito diario.

# loginSuccess
source: Login successful!
es: ¡Inicio de sesión exitoso!

source: Continuing as guest
es: Continuando como invitado

source: Reset password
es: Restablecer contraseña

source: Frequency Type
es: Tipo de Frecuencia

# frequencyTypeDaily
source: Every day
es: Todos los días

# frequencyTypeWeekdays
source: Weekdays only
es: Solo días laborales

# frequencyTypeCustom
source: Custom days
es: Días personalizados

# frequencyTypeWeekly
source: X days per week
es: X días por semana

# selectFrequencyType
source: Select how often you want to do this habit
es: Selecciona con qué frecuencia quieres hacer este hábito

# dailyDescription
source: Do this habit every single day
es: Hacer este hábito todos los días

# weekdaysDescription
source: Monday through Friday only
es: Solo de lunes a viernes

# customDescription
source: Choose specific days of the week
es: Elegir días específicos de la semana

# weeklyDescription
source: Choose how many days per week (flexible)
es: Elegir cuántos días por semana (flexible)

source: Days per week
es: Días por semana

# selectDaysPerWeek
source: How many days per week?
es: ¿Cuántos días por semana?

# timesPerWeek
source: {count} {count, plural, =1{time} other{times}} per week
es: {count} {count, plural, =1{vez} other{veces}} por semana

source: At least once per week
es: Al menos una vez por semana

# targetDaysPerWeek
source: {count} days per week
es: {count} días por semana

source: ✓ Weekly target met!
es: ✓ ¡Meta semanal cumplida!

# weeklyTargetProgress
source: {completed} of {target} days this week
es: {completed} de {target} días esta semana

# weeklyStreakLabel
source: {count} {count, plural, =1{week} other{weeks}} streak
es: Racha de {count} {count, plural, =1{semana} other{semanas}}

# dailyStreakLabel
source: {count} {count, plural, =1{day} other{days}} streak
es: Racha de {count} {count, plural, =1{día} other{días}}

# bonusPoints
source: +{points} bonus points!
es: ¡+{points} puntos bonus!

# weeklyBonusEarned
source: Weekly target completed! +10 bonus points
es: ¡Meta semanal completada! +10 puntos bonus

# frequencyTypeRequired
source: Please select a frequency type
es: Por favor selecciona un tipo de frecuencia

# weeklyTargetRequired
source: Please select how many days per week
es: Por favor selecciona cuántos días por semana

# appTitle
source: RITMO
da: Vane Pro
id: Kebiasaan Pro

# homeAppBarTitle
source: RITMO
da: Vane Pro
id: Kebiasaan Pro

# mayShort
source: May
da: Maj
id: Mei

# octoberShort
source: Oct
da: Okt
id: Okt
