Repository: NoSFeR88/habito-pro-flutter
Catalog: lib/l10n/app_*.arb
Languages: da, es, id

source: Loading...
da: Indlæser...
es: Cargando...
id: Memuat...

# loadingApp
source: Starting Ritmo...
es: Iniciando Ritmo...

source: Retry
da: Prøv igen
es: Reintentar
id: Coba lagi

source: Today
da: I dag
es: Hoy
id: Hari ini

# todayWithDate
source: Today • {date}
da: I dag • {date}
es: Hoy • {date}
id: Hari ini â€¢ {date}

# allDoneToday
source: All done for today!
da: Alt færdigt i dag!
es: ¡Todo listo por hoy!
id: Semua selesai untuk hari ini!

# noProgrammedHabits
source: You have no rhythms scheduled for today or you've completed them all.
da: Du har ingen vaner planlagt for i dag eller du har fuldført dem alle.
es: No tienes ritmos programados para hoy o ya los completaste todos.
id: Anda tidak memiliki kebiasaan yang dijadwalkan untuk hari ini atau sudah menyelesaikan semuanya.

# createFirstHabit
source: Create my first rhythm
da: Opret min første vane
es: Crear mi primer ritmo
id: Buat kebiasaan pertama saya

# rhythmUpdated
source: Habit updated!
es: ¡Ritmo actualizado!

source: Edit
da: Rediger
es: Editar

source: View statistics
da: Se statistikker
es: Ver estadísticas
id: Lihat statistik

source: Delete
da: Slet
es: Eliminar
id: Hapus

# deleteHabit
source: Delete rhythm
da: Slet vane
es: Eliminar ritmo
id: Hapus kebiasaan

# confirmDeleteHabit
source: Are you sure you want to delete "{rhythmName}"?
da: Er du sikker på, at du vil slette "{habitName}"?
es: ¿Estás seguro de que quieres eliminar "{rhythmName}"?
id: Apakah Anda yakin ingin menghapus "{habitName}"?

source: Cancel
da: Annuller
es: Cancelar
id: Batal

# rhythmDeleted
source: Habit "{rhythmName}" deleted
es: Ritmo "{rhythmName}" eliminado

# mondayShort
source: Mon
da: Man
es: Lun
id: Sen

# tuesdayShort
source: Tue
da: Tir
es: Mar
id: Sel

# wednesdayShort
source: Wed
da: Ons
es: Mié
id: Rab

# thursdayShort
source: Thu
da: Tor
es: Jue
id: Kam

# fridayShort
source: Fri
da: Fre
es: Vie
id: Jum

# saturdayShort
source: Sat
da: Lør
es: Sáb
id: Sab

# sundayShort
source: Sun
da: Søn
es: Dom
id: Min

source: Skip
es: Omitir

source: Next
es: Siguiente

# onboardingWelcomeTitle
source: Welcome to Ritmo!
es: ¡Bienvenido a Ritmo!

# onboardingWelcomeSubtitle
source: The only rhythm app that adapts to YOUR real life
es: La única app de hábitos que se adapta a TU vida real

# onboardingFeatureFlexible
source: Flexible rhythms adapted to you
es: Hábitos flexibles adaptados a ti

# onboardingFeatureMotivating
source: Motivating design that inspires
es: Diseño motivador que inspira

# onboardingFeature26Languages
source: 26 languages - Market leader
es: 26 idiomas - Líder del mercado

# onboardingDiscoverDifference
source: Discover the difference
es: Descubre la diferencia

# onboardingProblemTitle
source: Tired of overly rigid apps?
es: ¿Cansado de apps demasiado rígidas?

# onboardingOtherApps
source: Other apps
es: Otras apps

# onboardingProblemExample
source: Gym EVERY day ❌
es: Gym TODOS los días ❌

# onboardingSolutionExample
source: Gym Mon-Wed-Fri ✅ (YOUR rhythm)
es: Gym Lun-Mié-Vie ✅ (TU ritmo)

# onboardingFlexibilityMessage
source: Your life is unique. Your rhythms should be too.
es: Tu vida es única. Tus hábitos también deberían serlo.

# onboardingThisSounds
source: This sounds familiar
es: Esto me suena familiar

# onboardingSetupTitle
source: Create your first flexible rhythm
es: Crea tu primer hábito flexible

# onboardingFlexibilityTip
source: 💡 Tip: Choose realistic days for your lifestyle
es: 💡 Consejo: Elige días realistas para tu estilo de vida

# onboardingCreateFirstHabit
source: Create my first rhythm
es: Crear mi primer hábito

# onboardingExampleHabitName
source: Go to the gym
es: Ir al gimnasio

# onboardingCelebrationTitle
source: Perfect! You have your rhythm
es: ¡Perfecto! Ya tienes tu ritmo

# onboardingCelebrationSubtitle
source: Your first flexible rhythm is ready to begin
es: Tu primer hábito flexible está listo para comenzar

# onboardingDefaultHabitName
source: My first rhythm
es: Mi primer hábito

# onboardingNoDaysSelected
source: No days selected
es: Sin días seleccionados

# onboardingBenefitFlexibility
source: Total flexibility
es: Flexibilidad total

# onboardingBenefitMotivation
source: Constant motivation
es: Motivación constante

# onboardingBenefit26Languages
source: 26 languages available
es: 26 idiomas disponibles

# onboardingStartMyRhythm
source: Start my rhythm
es: Comenzar mi ritmo

# rhythmName
source: Habit name
es: Nombre del ritmo

# rhythmNameHint
source: E.g: Exercise, Read, Meditate...
es: Ej: Ejercicio, Leer, Meditar...

source: Select days
es: Selecciona días

# januaryShort
source: Jan
es: Ene

# aprilShort
source: Apr
es: Abr

# augustShort
source: Aug
es: Ago
id: Agu

# decemberShort
source: Dec
es: Dic
id: Des

# newHabit
source: New Rhythm
da: Ny Vane
es: Nuevo Ritmo
id: Kebiasaan Baru

source: Save
da: Gem
es: Guardar
id: Simpan

# statsToday
source: Today
da: I dag
es: Hoy
id: Hari ini

# statsWeek
source: Week
da: Uge
es: Semana
id: Minggu

# statsMonth
source: Month
da: Måned
es: Mes
id: Bulan

source: Notification Tests
da: Notifikationstest
es: Pruebas de Notificaciones
id: Tes Notifikasi

source: Immediate Notification
da: Øjeblikkelig Notifikation
es: Notificación Inmediata
id: Notifikasi Langsung

# showNotificationNow
source: Show notification right now
da: Vis notifikation nu
es: Mostrar notificación ahora mismo
id: Tampilkan notifikasi sekarang

source: Scheduled Notification
da: Planlagt Notifikation
es: Notificación Programada
id: Notifikasi Terjadwal

# scheduleIn5Seconds
source: Schedule notification in 5 seconds
da: Planlæg notifikation om 5 sekunder
es: Programar notificación en 5 segundos
id: Jadwalkan notifikasi dalam 5 detik

source: Reschedule All Habits
da: Genplanlæg Alle Vaner
es: Reprogramar Todos los Hábitos
id: Jadwalkan Ulang Semua Kebiasaan

source: Update all notifications
da: Opdater alle notifikationer
es: Actualizar todas las notificaciones
id: Perbarui semua notifikasi

source: View Pending Notifications
da: Se Ventende Notifikationer
es: Ver Notificaciones Pendientes
id: Lihat Notifikasi Tertunda

source: Show scheduled notifications
da: Vis planlagte notifikationer
es: Mostrar notificaciones programadas
id: Tampilkan notifikasi terjadwal

# notificationSent
source: Notification sent! Check your notification bar
da: Notifikation sendt! Tjek din notifikationsbjælke
es: ¡Notificación enviada! Revisa la barra de notificaciones
id: Notifikasi terkirim! Periksa bilah notifikasi Anda

# notificationScheduled
source: ✅ Notification scheduled: {rhythmName} - {dateTime}
da: Notifikation planlagt om 5 sekunder
es: ✅ Notificación programada: {rhythmName} - {dateTime}
id: Notifikasi dijadwalkan selama 5 detik

# notificationsRescheduled
source: Notifications rescheduled successfully
da: Notifikationer genplanlagt succesfuldt
es: Notificaciones reprogramadas exitosamente
id: Notifikasi berhasil dijadwalkan ulang

source: Pending Notifications
da: Ventende Notifikationer
es: Notificaciones Pendientes
id: Notifikasi Tertunda

source: No pending notifications
da: Ingen ventende notifikationer
es: No hay notificaciones pendientes
id: Tidak ada notifikasi tertunda

source: Close
da: Luk
es: Cerrar
id: Tutup

source: Monthly Progress
es: Progreso Mensual

# rhythmStreaks
source: Habit Streaks
es: Rachas de Hábitos

source: Monthly Calendar
es: Calendario del Mes

# monthlyStats
source: Monthly Statistics
es: Estadísticas del Mes

source: Active Days
es: Días Activos

source: Best Streak
es: Mejor Racha

# averageCompletion
source: Average
es: Promedio

source: Settings
es: Configuración

source: Language
es: Idioma

source: Themes
es: Temas

# themeBasicBlue
source: Basic Blue
es: Azul Básico

# themeBasicGreen
source: Basic Green
es: Verde Básico

# themeBasicPurple
source: Basic Purple
es: Morado Básico

# themeCyberNeon
source: 🌟 Cyber Neon
es: 🌟 Neón Cibernético

# themeAuroraInspiration
source: 🎨 Aurora Inspiration
es: 🎨 Inspiración Aurora

# themeZenGarden
source: 🧘 Zen Garden
es: 🧘 Jardín Zen

source: Premium Themes
es: Temas Premium

# activatePremium
source: Activate Premium (Testing)
es: Activar Premium (Pruebas)

# premiumPrice
source: $2.99/month
es: $2.99/mes

source: Notifications
es: Notificaciones

# manageHabits
source: Manage Rhythms
es: Gestionar Ritmos

# noActiveHabits
source: No active rhythms
es: No hay ritmos activos

# createFirstHabitToStart
source: Create your first rhythm to get started
es: Crea tu primer ritmo para comenzar

# noPausedHabits
source: No paused rhythms
es: No hay ritmos pausados

# pausedHabitsWillAppearHere
source: Paused rhythms will appear here
es: Los ritmos pausados aparecerán aquí

# noHabits
source: You have no rhythms
es: No tienes ritmos

# startJourneyCreatingFirstHabit
source: Start your journey by creating your first rhythm
es: Comienza tu viaje creando tu primer hábito

# deleteHabitConfirm
source: Are you sure you want to delete this rhythm?
es: ¿Estás seguro de que quieres eliminar este hábito?

# editHabit
source: Edit Rhythm
es: Editar Ritmo

source: Basic Information
es: Información Básica

# rhythmNameLabel
source: Habit name
es: Nombre del Ritmo

source: Description (optional)
es: Descripción (Opcional)

# descriptionHint
source: E.g: 8 glasses per day, 30 minutes...
es: Ej: 8 vasos por día, 30 minutos...

source: Monday
es: Lunes

source: Tuesday
es: Martes

source: Wednesday
es: Miércoles

source: Thursday
es: Jueves

source: Friday
es: Viernes

source: Saturday
es: Sábado

source: Sunday
es: Domingo

source: All days
es: Todos los días

source: Weekdays
es: Días laborables

# deleteHabitButton
source: Delete rhythm
es: Eliminar Hábito

# deleteWarning
source: This action cannot be undone. All rhythm data including completion history will be deleted.
es: Esta acción no se puede deshacer. Se eliminarán todos los datos del hábito incluyendo el historial de completados.

# selectAtLeastOneDay
source: Select at least one day of the week
es: Por favor selecciona al menos un día de la semana

# rhythmUpdatedSuccess
source: Habit "{rhythmName}" updated successfully
es: Hábito "{rhythmName}" actualizado exitosamente

# errorUpdatingHabit
source: Error updating rhythm: {error}
es: Error al actualizar el hábito: {error}

# deleteHabitTitle
source: Delete rhythm
es: Eliminar Hábito

# deleteHabitConfirmation
source: Are you sure you want to delete "{rhythmName}"?\n\nThis action cannot be undone. All rhythm data including completion history will be deleted.
es: ¿Estás seguro de que quieres eliminar "{rhythmName}"?\n\nEsta acción no se puede deshacer. Todos los datos del ritmo incluyendo el historial de completados serán eliminados.

# rhythmDeletedSuccess
source: Habit "{rhythmName}" deleted
es: Hábito "{rhythmName}" eliminado

# errorDeletingHabit
source: Error deleting rhythm: {error}
es: Error al eliminar el hábito: {error}

# limitReached
source: Limit reached: maximum {maxHabits} rhythms in free plan.
es: Límite alcanzado: máximo {maxHabits} ritmos en el plan gratuito.

# premiumThemesOnly
source: Premium themes are only available in Ritmo PRO.
es: Los temas premium solo están disponibles en Ritmo PRO.

# advancedStatsOnly
source: Advanced statistics available in Ritmo PRO.
es: Las estadísticas avanzadas están disponibles en Ritmo PRO.

# exportDataOnly
source: Export data is available in Ritmo PRO.
es: La exportación de datos está disponible en Ritmo PRO.

# aiInsightsOnly
source: AI Insights are available in Ritmo PRO.
es: Los análisis con IA están disponibles en Ritmo PRO.

# featureOnlyInPro
source: This feature is available in Ritmo PRO.
es: Esta función está disponible en Ritmo PRO.

# loadingYourHabits
source: Loading your rhythms...
es: Cargando tus hábitos...

# guestMode
source: Guest mode - Your data will not be saved
es: Modo invitado - Tus datos no se guardarán

# createAccountToSave
source: Create an account to save your rhythms and sync them across devices.
es: Crea una cuenta para guardar tus ritmos y sincronizarlos entre dispositivos.

source: Later
es: Más tarde

# loginError
source: Login error: {error}
es: Error de inicio de sesión: {error}

# logoutError
source: Error logging out: {error}
es: Error al cerrar sesión: {error}

source: Wrong password.
es: Contraseña incorrecta.

# passwordTooShort
source: Password must be at least 6 characters.
es: La contraseña debe tener al menos 6 caracteres.

# invalidEmail
source: Email is not valid.
es: El correo electrónico no es válido.

# tooManyAttempts
source: Too many attempts. Try again later.
es: Demasiados intentos. Intenta de nuevo más tarde.

# connectionError
source: Connection error. Check your internet.
es: Error de conexión. Verifica tu internet.

# authError
source: Authentication error: {message}
es: Error de autenticación: {message}

source: Champion
es: Campeón

source: Hero
es: Héroe

source: Mythic
es: Mítico

source: Maximum
es: Máximo

# completeFirstHabit3Days
source: Complete your first rhythm 3 days in a row
es: Completa tu primer hábito 3 días seguidos

# maintain7DayStreak
source: Maintain a 7-day streak
es: Mantén una racha de 7 días

# maintain30DayStreak
source: Maintain a 30-day streak
es: Mantén una racha de 30 días

# completeFirstHabit
source: Complete your first rhythm
es: Completa tu primer hábito

# complete100Habits
source: Complete 100 rhythms total
es: Completa 100 hábitos en total

# complete500Habits
source: Complete 500 rhythms total
es: Completa 500 hábitos en total

# completeAllHabitsWeek
source: Complete all your rhythms during a week
es: Completa todos tus hábitos durante una semana

# create5DifferentHabits
source: Create 5 different rhythms
es: Crea 5 hábitos diferentes

source: Reach level 5
es: Alcanza el nivel 5

# noHabitsToday
source: You have no rhythms scheduled for today or you've completed them all.
es: No tienes hábitos para hoy

# allHabitsPaused
source: All your habits are paused. Reactivate one or create a new one.
es: Todos tus hábitos están pausados. Reactiva alguno o crea uno nuevo.

# startJourneyBetterHabits
source: Start your journey towards better rhythms by creating your first daily rhythm.
es: Comienza tu viaje hacia mejores hábitos

source: Create new habit
es: Crear nuevo hábito

source: Create my first habit
es: Crear mi primer hábito

source: Notification Settings
es: Configuración de Notificaciones

# receiveRemindersForHabits
source: Receive reminders for your rhythms
es: Recibe recordatorios para tus hábitos

# openSystemSettings
source: Open system settings to manage notifications
es: Abrir configuración del sistema

# settingsLabel
source: Settings
es: Configuración

# rhythmReminders
source: Habit Reminders
es: Recordatorios de Hábitos

# notificationsToRemind
source: Notifications to remind you to complete your daily rhythms
es: Notificaciones para recordarte completar tus ritmos diarios

# reminderTicker
source: Habit reminder
es: Recordatorio de hábito

# timeToWorkOnHabit
source: Time to work on your rhythm!
es: ¡Es hora de trabajar en tu hábito!

# notificationsCancelled
source: ✅ Cancelled notifications for rhythm {rhythmId}
es: ✅ Notificaciones canceladas para el ritmo {rhythmId}

# errorCancellingNotifications
source: ❌ Error cancelling notifications for rhythm {rhythmId}: {error}
es: ❌ Error al cancelar notificaciones para el ritmo {rhythmId}: {error}

# instantNotificationSent
source: ✅ Instant notification sent: {title}
es: ✅ Notificación instantánea enviada: {title}

# errorSendingNotification
source: ❌ Error sending instant notification: {error}
es: ❌ Error al enviar notificación instantánea: {error}

# testNotificationTitle
source: 🧪 Test Notification
es: 🧪 Prueba de Notificación

# scheduledNotificationTitle
source: ⏰ Scheduled Notification
es: ⏰ Notificación Programada

# scheduledNotificationBody
source: This notification was scheduled 5 seconds ago
es: Esta notificación fue programada hace 5 segundos

# testNotificationScheduled
source: ✅ Test notification scheduled for 5 seconds
es: ✅ Notificación de prueba programada para 5 segundos

# errorSchedulingTestNotification
source: ❌ Error scheduling test notification: {error}
es: ❌ Error al programar notificación de prueba: {error}

# localizationInitialized
source: ✅ Localization initialized: {languageCode}
es: ✅ Localización inicializada: {languageCode}

# notificationReceivediOS
source: 📱 Notification received on iOS: {title}
es: 📱 Notificación recibida en iOS: {title}

# userTappedNotification
source: 📱 User tapped notification: {payload}
es: 📱 Usuario tocó la notificación: {payload}

# rhythmUpdatedSuccessfully
source: Habit "{rhythmName}" updated successfully
es: Hábito "{rhythmName}" actualizado exitosamente

# confirmDeleteHabitMessage
source: Are you sure you want to delete "{rhythmName}"?\n\nThis action cannot be undone. All rhythm data including completion history will be deleted.
es: ¿Estás seguro de que quieres eliminar "{rhythmName}"?\n\nEsta acción no se puede deshacer. Todos los datos del ritmo incluyendo el historial de completado serán eliminados.

# rhythmDeletedSuccessfully
source: Habit "{rhythmName}" deleted
es: Hábito "{rhythmName}" eliminado

# rhythmCreatedSuccessfully
source: Habit "{rhythmName}" created successfully
es: Hábito "{rhythmName}" creado exitosamente

# confirmDeleteHabitShort
source: Are you sure you want to delete "{rhythmName}"?
es: ¿Estás seguro de que quieres eliminar "{rhythmName}"?

# ensureAppNotInDoNotDisturb
source: • Make sure the app is not in "Do Not Disturb" mode\n
es: • Asegúrate de que la app no esté en modo "No Molestar"\n

source: First Streak
es: Primera Racha

# firstStreakDescription
source: Complete your first rhythm 3 days in a row
es: Completa tu primer hábito 3 días seguidos

source: Week Warrior
es: Guerrero Semanal

# weekWarriorDescription
source: Maintain a 7-day streak
es: Mantén una racha de 7 días

source: Month Master
es: Maestro del Mes

# monthMasterDescription
source: Maintain a 30-day streak
es: Mantén una racha de 30 días

source: First Step
es: Primer Paso

# firstStepDescription
source: Complete your first rhythm
es: Completa tu primer hábito

source: Century Club
es: Club del Centenar

# centuryClubDescription
source: Complete 100 rhythms total
es: Completa 100 hábitos en total

source: Marathon Runner
es: Corredor de Maratón

# marathonRunnerDescription
source: Complete 500 rhythms total
es: Completa 500 hábitos en total

source: Perfect Week
es: Semana Perfecta

# perfectWeekDescription
source: Complete all your rhythms during a week
es: Completa todos tus hábitos durante una semana

# rhythmCreator
source: Habit Creator
es: Creador de Hábitos

# rhythmCreatorDescription
source: Create 5 different rhythms
es: Crea 5 ritmos diferentes

source: Achievements
es: Logros

source: Your Progress
es: Tu Progreso

source: Level
es: Nivel

source: Points
es: Puntos

source: Total accumulated
es: Total acumulado

# achievementsLabel
source: Achievements
es: Logros

source: Unlocked
es: Desbloqueado

source: Streak
es: Racha

source: Max days
es: Máximo de días

source: Current Level
es: Nivel Actual

source: Next Level
es: Siguiente Nivel

source: Points to next
es: Puntos para el siguiente nivel

source: All Achievements
es: Todos los Logros

source: Progress to Next Level
es: Progreso al Siguiente Nivel

# paywallMonthly
source: Monthly
es: Mensual

# paywallAnnual
source: Annual
es: Anual

# paywallLifetime
source: Lifetime
es: De por vida

# paywallPerMonth
source: /month
es: /mes

# paywallPerYear
source: /year
es: /año

# paywallOneTimePayment
source: one-time payment
es: pago único

# paywallDiscount
source: 37% OFF
es: 37% DESCUENTO

# paywallLimitedOffer
source: LIMITED OFFER
es: OFERTA LIMITADA

# paywallUnlimitedHabits
source: Unlimited Habits
es: Hábitos ilimitados

# paywallUnlimitedHabitsDesc
source: Create all the habits you want
es: Crea todos los hábitos que quieras

# paywallAdvancedStats
source: Advanced Statistics
es: Estadísticas avanzadas

# paywallAdvancedStatsDesc
source: Deep analysis and trends
es: Análisis profundo y tendencias

# paywallPremiumThemes
source: 5 Premium Themes
es: 5 temas premium

# paywallPremiumThemesDesc
source: Ocean, Sunset, Forest and more
es: Ocean, Sunset, Forest y más

# paywallNoAds
source: No Ads
es: Sin publicidad

# paywallNoAdsDesc
source: Completely clean experience
es: Experiencia completamente limpia

# paywallAutoBackup
source: Automatic Backup
es: Backup automático

# paywallAutoBackupDesc
source: Your data safe in the cloud
es: Tus datos seguros en la nube

# paywallAiInsights
source: AI Insights
es: Insights con IA

# paywallAiInsightsDesc
source: Smart recommendations
es: Recomendaciones inteligentes

# paywallErrorCreatingHabit
source: Error creating habit
es: Error al crear el hábito

# paywallErrorLogin
source: Anonymous login error
es: Error en el inicio de sesión anónimo

# paywallErrorGoogleLogin
source: Google login error
es: Error al iniciar sesión con Google

# paywallErrorEmailLogin
source: Email login error
es: Error al iniciar sesión con correo electrónico

# paywallErrorRegistration
source: Registration error
es: Error en el registro

# paywallErrorLogout
source: Logout error
es: Error al cerrar sesión

# paywallErrorPasswordReset
source: Error sending password reset email
es: Error al enviar el correo de restablecimiento de contraseña

# paywallErrorDeleteAccount
source: Error deleting account
es: Error al eliminar la cuenta

# paywallErrorUpdateProfile
source: Error updating profile
es: Error al actualizar el perfil

# paywallErrorGetUserData
source: Error getting user data
es: Error al obtener los datos del usuario

# paywallErrorUpdatePreferences
source: Error updating preferences
es: Error al actualizar las preferencias

# paywallErrorUpdatePremium
source: Error updating premium status
es: Error al actualizar el estado premium

# paywallErrorLinkAccount
source: Error linking account
es: Error al vincular la cuenta

# paywallErrorGetHabits
source: Error getting habits
es: Error al obtener los hábitos

# paywallErrorUpdateHabit
source: Error updating habit
es: Error al actualizar el hábito

# paywallErrorDeleteHabit
source: Error deleting habit
es: Error al eliminar el hábito

# paywallErrorHabitNotFound
source: Habit not found
es: No se encontró el hábito

# paywallErrorUpdateCompletion
source: Error updating completion
es: Error al actualizar el progreso

# paywallErrorGetStats
source: Error getting statistics
es: Error al obtener las estadísticas

# paywallErrorBackup
source: Error performing backup
es: Error al realizar la copia de seguridad

# paywallErrorGetPeriodData
source: Error getting period data
es: Error al obtener los datos del período

# paywallErrorCleanOldData
source: Error cleaning old data
es: Error al limpiar los datos antiguos

# paywallErrorLoadingHabits
source: Error loading habits
es: Error al cargar los hábitos

# pointsToLevel
source: {points} points to level {level}
es: {points} puntos para nivel {level}

source: Unlocked ({count})
es: Desbloqueados ({count})

source: Locked ({count})
es: Bloqueados ({count})

source: Active
es: Activo

source: Paused
es: Pausado

source: All
es: Todos

# premiumTestingActivated
source: 🎉 Premium activated for testing
es: 🎉 Premium activado para pruebas

source: Remove ads
es: Quitar anuncios

# removePermanentAds
source: Remove advertising
es: Eliminar publicidad permanentemente

source: No advertising
es: Sin publicidad

# premiumThemesFeature
source: Premium themes
es: Temas premium

source: Start PRO
es: Iniciar PRO

source: Drink water
es: Beber agua

source: Exercise
es: Hacer ejercicio

source: Read
es: Leer

source: Completed
es: Completado

source: Current Streak
es: Racha actual

source: Scheduled
es: Programado

source: Good afternoon
es: Buenas tardes

source: Good evening
es: Buenas noches

source: January
es: Enero

source: February
es: Febrero

source: March
es: Marzo

source: April
es: Abril
